AccumulationRegisters/ДенежныеСредстваМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваМНО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/УсловияСделокСМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСМО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилоРасчетаПроцента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаРасчетаПроцентовСМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШкалаПроцентныхСтавок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыПроцентныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляНачисленияПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазаДляНачисленияПроцентовНаОстаткиДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СделкаСМО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСМО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналОперацийБэкОфиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийБэкОфиса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПериодичностьПереоценкиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностьПереоценкиАктивов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ежедневно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПереоценивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноИПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжеквартальноИПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодноИПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноВПоследнийРабочийДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйБухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПравилаРасчетаПроцентовСМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПравилаРасчетаПроцентовСМО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АбсолютноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекрементОтКлючевойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШкалаПроцентныхСтавок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходПроцентовМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходПроцентовМНО</Name>
			<BasedOn>
				<xr:Item>Document.МНО</xr:Item>
				<xr:Item>Document.СделкаСМО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСМО</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаМНО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ШкалыПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ШкалыПроцентныхСтавок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСМНО/Ext/Module.bsl
Функция РасчетСуммыМНО(ДанныеЗаполнения, Знач ДатаОценкиМНО) Экспорт
	
	Срок = (НачалоДня(ДатаОценкиМНО) - НачалоДня(ДанныеЗаполнения.Дата)) / 86400;
		
	Дней365 		= 0;
	Дней366 		= 0;
	ДатаПроверяемая = НачалоДня(ДанныеЗаполнения.Дата);
	ДатаОценкиМНО	= НачалоДня(ДатаОценкиМНО);
	
	Пока ДатаПроверяемая < ДатаОценкиМНО  Цикл
		ДатаПроверяемая = ДатаПроверяемая + 86400;
		Если (КонецГода(ДатаПроверяемая) + 1 - НачалоГода(ДатаПроверяемая)) / 86400 = 366 Тогда
			Дней366 = Дней366 + 1;
		Иначе
			Дней365 = Дней365 + 1;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Окр((ДанныеЗаполнения.Сумма * ДанныеЗаполнения.Процент) / 100 * (Дней365/365 + Дней366/366), 2);
	
КонецФункции	

// Определяет, требуется ли переоценивать МНО по виду учета на дату переоценки
// 	СчетДоверительногоУправления	- СправочникСсылка СчетаДоверительногоУправления
// 	ВидУчета 						- ПеречислениеСсылка.ВидыУчета Или Неопределено
//									  Неопределено - для учета в Бэк-офмсе
// 	Период							- Дата - проверяемая дата
//  ДатаПоследнейПереоценки         - Дата, в нее помещается дата последней переоценки МНО, соответствующая настройкам
Функция ОпределитьНеобходимостьПереоценкиМНОПоВидуУчета(СчетДоверительногоУправления, ВидУчета = Неопределено, Период, ДатаПоследнейПереоценки = '00010101') Экспорт
	
	ПериодичностьМесяц 		= Ложь;
	
	ДатаПереоценки = НачалоДня(Период);
		
	Если ВидУчета = Неопределено Тогда
		// Бэк-офис
		// Отдельного регистра с настройками периодичности переоценки пока нет, по умолчанию - ежемесячно.
		// Другие виды периодичности не автоматизированы (не требуются пока) 
		ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежемесячно;
		
		// Получаем последнюю в текущем месяце дату переоценки по настройкам периодичности СЧА
		ДатаСЧАПоНастройкам = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(СчетДоверительногоУправления, НачалоМесяца(Период), КонецМесяца(Период));
		Если ДатаСЧАПоНастройкам = НачалоДня(ДатаПереоценки) Тогда
			ПериодичностьМесяц = Истина;
		КонецЕсли;
		
		Если ПериодичностьМесяц Тогда
			НеобходимостьПереоценки = Истина;
			ДатаПоследнейПереоценки = ДатаПереоценки;
		КонецЕсли;	

		Если ДатаПоследнейПереоценки <> ДатаПереоценки Тогда
			// Определяем предыдущую дату переоценки по настройкам периодичности СЧА
			ДатаПоследнейПереоценки = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(СчетДоверительногоУправления, ДобавитьМесяц(НачалоМесяца(Период), -1), КонецМесяца(ДобавитьМесяц(Период, -1)));
		КонецЕсли;
		
	Иначе
		
		// Для других видов учета есть настройки
		КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ДатаПереоценки);

		Если ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			УчетныйАктив = Справочники.УчетныеАктивыЕПС.ПроцентыНаМНО;
		Иначе	
			УчетныйАктив = Справочники.УчетныеАктивы.ПроцентыНаМНО;
		КонецЕсли; 
		
		ПериодичностьПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ДатаПереоценки, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, УчетныйАктив, ВидУчета, "ПериодичностьПереоценки");
		
		НеобходимостьПереоценки = Ложь;
		
		Если БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, ДатаПереоценки, КалендарьДляСчетаДУ) Тогда 
			НеобходимостьПереоценки = Истина;
			ДатаПоследнейПереоценки = ДатаПереоценки;
		КонецЕсли;
	
		Если ДатаПоследнейПереоценки <> ДатаПереоценки Тогда
			// Определяем предыдущую дату переоценки в зависимости от периодичности
			Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
				ДатаПоследнейПереоценки = НачалоДня(ДатаПереоценки - 86400);
			ИначеЕсли ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежегодно 
				ИЛИ ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежеквартально 
				ИЛИ ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежемесячно Тогда
				ДатаПоследнейПереоценки = НачалоДня(БухгалтерскийУчетЕПС.ПервыйДеньПериода(ДатаПереоценки, ПериодичностьПереоценки) - 1);
			ИначеЕсли ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.ЕжемесячноВПоследнийРабочийДень Тогда
				ДатаПоследнейПереоценки =  НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(НачалоМесяца(ДатаПереоценки) - 1)));
			КонецЕсли; 		
		КонецЕсли;
	КонецЕсли;	
		
	Возврат НеобходимостьПереоценки;
	                                         
КонецФункции //ОпределитьНеобходимостьПереоценкиМНОПоУчетнойПолитике

Функция ПолучитьСтоимостиМНОСчетуДоверительногоУправления(СчетДоверительногоУправления, ВидУчета = Неопределено, ОпределитьПериодичностьПереоценкиМНО, Знач Период, ЦельРасчета, Отказ, МенеджерВременныхТаблиц = Неопределено) Экспорт

	ДатаПоследнейПереоценки = '00010101';
	
	Если ОпределитьПериодичностьПереоценкиМНО Тогда
		НеобходимостьПереоценки = РаботаСМНО.ОпределитьНеобходимостьПереоценкиМНОПоВидуУчета(СчетДоверительногоУправления, ВидУчета, Период, ДатаПоследнейПереоценки);
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНООстатки.МНО КАК МНО,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток КАК СуммаМНО,
		|	0 КАК ПроцентыМНО
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки";

	Запрос.УстановитьПараметр("Период", 						Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);

	ДанныеМНО = Запрос.Выполнить().Выгрузить();
						
	Если ОпределитьПериодичностьПереоценкиМНО Тогда
		Период = КонецДня(ДатаПоследнейПереоценки);
	КонецЕсли; 

	Для каждого СтрокаМНО Из ДанныеМНО Цикл 		
		СтрокаМНО.ПроцентыМНО = РаботаСМНО.РасчетСуммыМНО(СтрокаМНО.МНО, Период);		
	КонецЦикла;
	
	Если НачалоДня(Период) <> '00010101' Тогда
		РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьМНОПоРыночнойСтавке(ДанныеМНО, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц, Отказ);
	КонецЕсли;
		
	Возврат ДанныеМНО;

КонецФункции

Функция РассчитатьПроцентыПоСделкамФЕО(Организация, СчетДоверительногоУправления, Период, Отказ) Экспорт
	
	#Область Текст_запроса
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокФЕО.СделкаСМО КАК Сделка,
		|	УсловияСделокФЕО.РасчетныйСчет КАК РасчетныйСчет,
		|	УсловияСделокФЕО.ПравилоРасчетаПроцента КАК ПравилоРасчетаПроцента,
		|	УсловияСделокФЕО.ШкалаПроцентныхСтавок КАК ШкалаПроцентныхСтавок,
		|	УсловияСделокФЕО.Процент КАК Процент,
		|	УсловияСделокФЕО.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	УсловияСделокФЕО.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ПОМЕСТИТЬ _УсловияСделокФЕО
		|ИЗ
		|	РегистрСведений.УсловияСделокСМО.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДоверительногоУправления)
		|				И БазаДляНачисленияПроцентов = ЗНАЧЕНИЕ(Перечисление.БазаДляНачисленияПроцентовНаОстаткиДенежныхСредств.ФактическийЕжедневныйОстаток)) КАК УсловияСделокФЕО
		|ГДЕ
		|	&Период МЕЖДУ УсловияСделокФЕО.ДатаНачалаДействия И УсловияСделокФЕО.ДатаОкончанияДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияСделокФЕО.Сделка КАК Сделка,
		|	_УсловияСделокФЕО.РасчетныйСчет КАК РасчетныйСчет,
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниНачисления
		|ИЗ
		|	_УсловияСделокФЕО КАК _УсловияСделокФЕО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(_УсловияСделокФЕО.ДатаНачалаДействия, ДЕНЬ, 1) И &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниНачисления.Дата КАК Дата,
		|	_ДниНачисления.Сделка КАК Сделка,
		|	СУММА(ВЫБОР
		|			КОГДА Авансы.Период >= _ДниНачисления.Дата
		|				ТОГДА 0
		|			КОГДА Авансы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Авансы.Сумма
		|			ИНАЧЕ -Авансы.Сумма
		|		КОНЕЦ) КАК СуммаНаНачалоДня,
		|	СУММА(ВЫБОР
		|			КОГДА Авансы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Авансы.Сумма
		|			ИНАЧЕ -Авансы.Сумма
		|		КОНЕЦ) КАК СуммаНаКонецДня
		|ПОМЕСТИТЬ _Авансы
		|ИЗ
		|	_ДниНачисления КАК _ДниНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК Авансы
		|		ПО (Авансы.Организация = &Организация)
		|			И (Авансы.СчетДоверительногоУправления В (&СчетДоверительногоУправления))
		|			И (Авансы.Основание = _ДниНачисления.Сделка)
		|			И (Авансы.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская))
		|			И (Авансы.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам))
		|			И (Авансы.Период <= КОНЕЦПЕРИОДА(_ДниНачисления.Дата, ДЕНЬ))
		|			И (Авансы.Аванс = ИСТИНА)
		|			И (Авансы.Активность = ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниНачисления.Дата,
		|	_ДниНачисления.Сделка
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВЫБОР
		|				КОГДА Авансы.Период >= _ДниНачисления.Дата
		|					ТОГДА 0
		|				КОГДА Авансы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА Авансы.Сумма
		|				ИНАЧЕ -Авансы.Сумма
		|			КОНЕЦ) > 0
		|		ИЛИ СУММА(ВЫБОР
		|				КОГДА Авансы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА Авансы.Сумма
		|				ИНАЧЕ -Авансы.Сумма
		|			КОНЕЦ) > 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Дата КАК Дата,
		|	ОстаткиДенежныхСредств.Сделка КАК Сделка,
		|	ОстаткиДенежныхСредств.Сумма - ЕСТЬNULL(_Авансы.СуммаНаНачалоДня, 0) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДниНачисления.Дата КАК Дата,
		|		_ДниНачисления.Сделка КАК Сделка,
		|		ЕСТЬNULL(СУММА(ВЫБОР
		|					КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ОстаткиДенежныхСредств.Сумма
		|					ИНАЧЕ -ОстаткиДенежныхСредств.Сумма
		|				КОНЕЦ), 0) КАК Сумма
		|	ИЗ
		|		_ДниНачисления КАК _ДниНачисления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ПО (ОстаткиДенежныхСредств.Организация = &Организация)
		|				И (ОстаткиДенежныхСредств.СчетДоверительногоУправления В (&СчетДоверительногоУправления))
		|				И (ОстаткиДенежныхСредств.РасчетныйСчет = _ДниНачисления.РасчетныйСчет)
		|				И (ОстаткиДенежныхСредств.Период < _ДниНачисления.Дата)
		|				И (ОстаткиДенежныхСредств.Активность = ИСТИНА)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДниНачисления.Дата,
		|		_ДниНачисления.Сделка) КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Авансы КАК _Авансы
		|		ПО (_Авансы.Сделка = ОстаткиДенежныхСредств.Сделка)
		|			И (_Авансы.Дата = ОстаткиДенежныхСредств.Дата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияСделокФЕО.Сделка КАК Сделка,
		|	_УсловияСделокФЕО.РасчетныйСчет КАК РасчетныйСчет,
		|	_ОстаткиДенежныхСредств.Дата КАК Дата,
		|	_ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА _УсловияСделокФЕО.ПравилоРасчетаПроцента = ЗНАЧЕНИЕ(Перечисление.ПравилаРасчетаПроцентовСМО.АбсолютноеЗначение)
		|			ТОГДА _УсловияСделокФЕО.Процент
		|		КОГДА _УсловияСделокФЕО.ПравилоРасчетаПроцента = ЗНАЧЕНИЕ(Перечисление.ПравилаРасчетаПроцентовСМО.ШкалаПроцентныхСтавок)
		|			ТОГДА ШкалаСтавок.ПроцентнаяСтавка
		|	КОНЕЦ КАК Ставка
		|ПОМЕСТИТЬ _ПроцентныеСтавки
		|ИЗ
		|	_УсловияСделокФЕО КАК _УсловияСделокФЕО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиДенежныхСредств КАК _ОстаткиДенежныхСредств
		|		ПО (_ОстаткиДенежныхСредств.Сделка = _УсловияСделокФЕО.Сделка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыПроцентныхСтавок.Шкала КАК ШкалаСтавок
		|		ПО (ШкалаСтавок.Ссылка = _УсловияСделокФЕО.ШкалаПроцентныхСтавок)
		|			И (ШкалаСтавок.МинимальноеЗначение < _ОстаткиДенежныхСредств.Сумма
		|				ИЛИ ШкалаСтавок.МинимальноеЗначение = 0)
		|			И (ШкалаСтавок.МаксимальноеЗначение >= _ОстаткиДенежныхСредств.Сумма
		|				ИЛИ ШкалаСтавок.МаксимальноеЗначение = 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнтервалыСумм.Сделка КАК Сделка,
		|	ИнтервалыСумм.РасчетныйСчет КАК РасчетныйСчет,
		|	СУММА(ВЫРАЗИТЬ(ИнтервалыСумм.Сумма * ИнтервалыСумм.Ставка / 100 * ИнтервалыСумм.КоличествоДней / ИнтервалыСумм.ДнейВГоду КАК ЧИСЛО(27, 2))) КАК СуммаПроцентов
		|ПОМЕСТИТЬ _ПроцентыНаОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПроцентныеСтавки.Сделка КАК Сделка,
		|		_ПроцентныеСтавки.РасчетныйСчет КАК РасчетныйСчет,
		|		_ПроцентныеСтавки.Сумма КАК Сумма,
		|		_ПроцентныеСтавки.Ставка КАК Ставка,
		|		ДЕНЬГОДА(КОНЕЦПЕРИОДА(_ПроцентныеСтавки.Дата, ГОД)) КАК ДнейВГоду,
		|		КОЛИЧЕСТВО(_ПроцентныеСтавки.Дата) КАК КоличествоДней
		|	ИЗ
		|		_ПроцентныеСтавки КАК _ПроцентныеСтавки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПроцентныеСтавки.Сделка,
		|		_ПроцентныеСтавки.РасчетныйСчет,
		|		_ПроцентныеСтавки.Сумма,
		|		_ПроцентныеСтавки.Ставка,
		|		ДЕНЬГОДА(КОНЕЦПЕРИОДА(_ПроцентныеСтавки.Дата, ГОД))) КАК ИнтервалыСумм
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнтервалыСумм.Сделка,
		|	ИнтервалыСумм.РасчетныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(Выплаты.Сделка, Авансы.Сделка) КАК Сделка,
		|	ЕСТЬNULL(Выплаты.Сумма, 0) - ЕСТЬNULL(Авансы.СуммаНаКонецДня, 0) КАК Сумма
		|ПОМЕСТИТЬ _Выплаты
		|ИЗ
		|	(ВЫБРАТЬ
		|		_УсловияСделокФЕО.Сделка КАК Сделка,
		|		СУММА(Выплаты.Сумма) КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК Выплаты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходПроцентовМНО КАК ПриходПроцентовМНО
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияСделокФЕО КАК _УсловияСделокФЕО
		|					ПО ПриходПроцентовМНО.МНО = _УсловияСделокФЕО.Сделка
		|				ПО (ЖурналОперацийБэкОфиса.Организация = &Организация)
		|					И (ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПриходПроцентовМНО))
		|					И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления В (&СчетДоверительногоУправления))
		|					И (ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен))
		|					И (ЖурналОперацийБэкОфиса.Дата МЕЖДУ _УсловияСделокФЕО.ДатаНачалаДействия И КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|					И ЖурналОперацийБэкОфиса.Документ = ПриходПроцентовМНО.Ссылка
		|			ПО (Выплаты.Организация = &Организация)
		|				И (Выплаты.СчетДоверительногоУправления В (&СчетДоверительногоУправления))
		|				И Выплаты.Регистратор = ЖурналОперацийБэкОфиса.Документ
		|				И (Выплаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|				И (Выплаты.Активность = ИСТИНА)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_УсловияСделокФЕО.Сделка) КАК Выплаты
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Авансы.Сделка КАК Сделка,
		|			_Авансы.СуммаНаКонецДня КАК СуммаНаКонецДня
		|		ИЗ
		|			_Авансы КАК _Авансы
		|		ГДЕ
		|			_Авансы.Дата = &Период) КАК Авансы
		|		ПО (Авансы.Сделка = Выплаты.Сделка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	_ПроцентныеСтавки.Сделка КАК Сделка,
		|	_ПроцентныеСтавки.Дата КАК Дата
		|ИЗ
		|	_ПроцентныеСтавки КАК _ПроцентныеСтавки
		|ГДЕ
		|	_ПроцентныеСтавки.Ставка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроцентыНаОстаток.Сделка КАК Сделка,
		|	_ПроцентыНаОстаток.РасчетныйСчет КАК РасчетныйСчет,
		|	ВЫБОР
		|		КОГДА _ПроцентыНаОстаток.СуммаПроцентов > ЕСТЬNULL(_Выплаты.Сумма, 0)
		|			ТОГДА _ПроцентыНаОстаток.СуммаПроцентов - ЕСТЬNULL(_Выплаты.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ПроцентыНаОстаток КАК _ПроцентыНаОстаток
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Выплаты КАК _Выплаты
		|		ПО (_Выплаты.Сделка = _ПроцентыНаОстаток.Сделка)";	
	
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", 						Период);

	РезультатПакета = Запрос.ВыполнитьПакет(); 
	
	ОшибкиОпределенияСтавки	= РезультатПакета[РезультатПакета.ВГраница() - 1];
	ПроцентыПоСделкамФЕО	= РезультатПакета[РезультатПакета.ВГраница()].Выгрузить();
	
	Если Не ОшибкиОпределенияСтавки.Пустой() Тогда		
		
		ОшибкаОпределенияСтавки = ОшибкиОпределенияСтавки.Выбрать();
		ОшибкаОпределенияСтавки.Следующий();
		
		ТекстОшибки = СтрШаблон("Ошибка расчета процентной ставки по '%1' за %2", ОшибкаОпределенияСтавки.Сделка, Формат(ОшибкаОпределенияСтавки.Дата, "ДФ=dd.MM.yyyy"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
			
	КонецЕсли;	

	Возврат ПроцентыПоСделкамФЕО; 	
	
КонецФункции

Функция ПолучитьДоходностьИДюрациюПоСделкеМНО(СделкаМНО, Период, СуммаМНО) Экспорт
	
	ДенежныеПотокиПоСделкеМНО = ПолучитьПлановыеВыплатыПоСделкеМНО(СделкаМНО, Период);
	
	Возврат БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ДенежныеПотокиПоСделкеМНО, НачалоДня(СделкаМНО.Дата), СуммаМНО);
	
КонецФункции

Функция ПолучитьПлановыеВыплатыПоСделкеМНО(СделкаМНО, Период) Экспорт
	
	ПлановыеВыплаты = Новый ТаблицаЗначений;
	ПлановыеВыплаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ПлановыеВыплаты.Колонки.Добавить("Сумма" , Новый ОписаниеТипов("Число"));
	
	НоваяСтрока = ПлановыеВыплаты.Добавить();
	НоваяСтрока.Период	= СделкаМНО.ДатаВозврата;
	НоваяСтрока.Сумма	= СделкаМНО.Сумма + РасчетСуммыМНО(СделкаМНО, СделкаМНО.ДатаВозврата);
	
	Возврат ПлановыеВыплаты;
	
КонецФункции
